Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: {craft\commerce\Variant:123:price} – returns the price of a Commerce Variant object with the id of 123.
ja: {craft\commerce\Variant:123:price} – ID が 123 の Commerce Variant オブジェクトの price を返します。

source: {entry:about-us:intro} – returns the value of an intro custom field on an entry with the slug about-us.
ja: {entry:about-us:intro} – スラグが about-us のエントリのカスタムフィールド intro の値を返します。

source: {entry:blog/whats-on-tap} – returns the URL of an entry in a blog section with the slug whats-on-tap.
ja: {entry:blog/whats-on-tap} – スラグが whats-on-tap の blog セクションのエントリの URL を返します。

source: {note} IIS fans: Make sure your site’s AppPool account has write permissions to these folders/files as well.
ja: 【メモ】 IIS ファン： サイトの AppPool アカウントがこれらのフォルダやファイルに書き込み権限を持っていることを確認してください。

source: {note} Accessing things via craft.app is considered highly advanced.
ja: 【メモ】craft.app 経由でアクセスすることは、高度な進化だと考えられます。

source: {note} By default the first column will be the elements’ IDs, but you can customize that with the select() param.
ja: 【メモ】 デフォルトでは、最初のカラムはエレメントの ID になりますが、select() パラメータでカスタマイズすることができます。

source: {note} By default the first column will be the element’s ID, but you can customize that with the select() param.
ja: 【メモ】デフォルトでは、最初のカラムはエレメントの ID になりますが、select() パラメータでカスタマイズすることができます。

source: {note} If the asArray param was set to true, then the element will be represented as a raw array, rather than an element object.
ja: 【メモ】asArray パラメータが true にセットされている場合エレメントはエレメントオブジェクトではなく、生の配列として表されます。

source: {note} If the asArray param was set to true, then the elements will be represented as raw arrays, rather than element objects.
ja: 【メモ】 asArray パラメータを true にセットしている場合、エレメントはエレメントオブジェクトではなく、生の配列として表されます。

source: {note} If the Setup Wizard skips this step, it’s because Craft is already able to connect to your database.
ja: 【メモ】 Craft がすでにデータベースに接続可能な状態であれば、このステップはスキップされます。

source: {note} If you’re on macOS, be careful not to lose the hidden files in there (.env, .env.example, .gitignore, and web/.htaccess).
ja: 【メモ】macOS を使用している場合、そこにある不可視ファイル（.env、.env.example、.gitignore、および web/.htaccess）を失わないよう注意してください。

source: {note} Migration names must be valid PHP class names, though we recommend sticking with snake_case rather than StudlyCase as a convention.
ja: 【メモ】マイグレーション名は有効な PHP クラス名でなければなりません。慣習として、StudlyCase よりも snake_case を使うことをお勧めします。

source: {note} Note that the default table prefix is now blank, whereas it used to be craft.
ja: 【メモ】デフォルトのテーブル接頭辞は「空」になりましたが、craft が使われていることに注意してください。

source: {note} Note that the default table prefix is now blank, whereas it used to be craft_.
ja: 【メモ】デフォルトのテーブル接頭辞は「空」になりましたが、craft_ が使われていることに注意してください。

source: {note} Setting the position to on load or on ready will cause Craft to load its internal copy of jQuery onto the page (even if the template is already including its own copy), so you should probably avoid using them in front-end templates.
ja: 【メモ】on load または on ready に位置をセットすると、（テンプレートがすでに独自のコピーを含めている場合でも）Craft はページに jQuery の内部コピーを読み込みます。そのため、フロントエンドのテンプレートで利用するのは避けてください。

source: {note} The tag calls yii\web\View::registerCss() under the hood, which can also be accessed via the global view variable.
ja: 【メモ】タグを yii\web\View::registerCss() の中で呼び出し、グローバルな view 変数経由でアクセスすることもできます。

source: {note} The tag calls yii\web\View::registerJs() under the hood, which can also be accessed via the global view variable.
ja: 【メモ】タグを yii\web\View::registerJs() の中で呼び出し、グローバルな view 変数経由でアクセスすることもできます。

source: {note} You must create your volumes within the Control Panel before Craft will start checking config/volumes.php for overrides.
ja: 【メモ】Craft が上書きのために config/volumes.php をチェックしはじめる前に、コントロールパネルでボリュームを作成しておく必要があります。

source: {note} You should be running Composer 1.3.0 or later.
ja: 【メモ】Composer 1.3.0 以降を稼働させるべきです。

source: {tip} Craft doesn’t require you to create additional web/ directories for new sites, though it’s fine if you need to.
ja: 【ヒント】必要とするならうまくできますが、Craft では新しいサイトのために追加の web/ ディレクトリを作成する必要はありません。

source: {tip} If you used Composer to download Craft, you can probably safely skip this step.
ja: 【ヒント】Craft のダウンロードに Composer を利用した場合、おそらく安全にこのステップをスキップできます。

source: {tip} If your Craft install is running from a Vagrant box, you will need to SSH into the box to run this command.
ja: 【ヒント】Craft のインストールが Vagrant box から実行されている場合、このコマンドを実行するために box に SSH 接続する必要があります。

source: {tip} If you’d prefer to download a zip file instead, you can download Craft 3 from the Download button in the header of craftcms.com.
ja: ヒント：ZIP ファイルのダウンロードを望むなら、craftcms.com のヘッダーにあるダウンロードボタンから Craft 3 をダウンロードできます。

source: {tip} Unlike entries, Global Sets don’t have the Live Preview feature, since they aren’t associated with any one particular URL.
ja: 【ヒント】エントリとは異なり、特定の URL と関連付けられていないグローバル設定では、ライブプレビュー機能がありません。

source: {tip} You can only nest categories up to the level specified in the Max Level field Category Group settings.
ja: 【ヒント】カテゴリグループの設定にある最大レベル欄で指定したレベルまでしか、カテゴリをネストできません。

source: {tip} You can override the Volume settings using the config/volumes.php configuration file.
ja: 【ヒント】設定ファイルの config/volumes.php を利用して、ボリューム設定を上書きできます。

source: {tip} You can use the url() function for appending query string parameters and/or enforcing a protocol on an absolute URL:
ja: 【ヒント】クエリ文字列パラメータを追加する、および / または、絶対 URL にプロトコルを適用するために、url() ファンクションを使うことができます。

source: – Any string of characters, except for a forward slash (/)
ja: – スラッシュ（/）を除く、任意の文字列

source: – Scales the image so that it is as big as possible with all dimensions fitting within the specified width and height.
ja: – すべての寸法が指定された幅と高さに収まる範囲で、可能な限り大きいサイズになるよう画像を拡大・縮小します。

source: “Switch statements” offer a clean way to compare a variable against multiple possible values, instead of using several repetitive {% if %} conditionals.
ja: 「Switch 文」は、いくつかの反復的な {% if %} 条件を使う代わりに、複数の可能性がある値に対して変数を比較するクリーンな方法を提供します。

source: …and replace everything below it with:
ja: そして、それ以下の行をすべて置き換えてください。

source: …if you access http://example.com/news/2020/10, your news/_archive.html template will get loaded with year and month variables set to '2017' and '04'.
ja: http://example.com/news/2020/10 にアクセスすると、news/_archive.html テンプレートは year と month 変数に 2017 と 04 をセットした状態で読み込まれます。

source: …then the correct relative path to images/ would be images/.
ja: images/ への正しい相対パスは images/ になります。

source: …then the correct relative path to web/images/ would be images/.
ja: web/images/ への正しい相対パスは images/ になります。

source: ↳ Access [Plugin Name]
ja: ↳ 「プラグイン名」 のアクセス

source: ↳ Access the CP when the system is off
ja: ↳ システムがオフの場合に管理画面にアクセスする

source: ↳ Administrate users
ja: ↳ ユーザーを管理

source: ↳ Assign permissions
ja: ↳ ユーザー権限を割り当てる

source: ↳ Create entries
ja: ↳ エントリを作る

source: ↳ Create subfolders
ja: ↳ サブフォルダを作成する

source: ↳ Delete entries
ja: ↳ エントリを削除する

source: ↳ Delete other authors’ drafts
ja: ↳ 他の投稿者の下書きを削除する

source: ↳ Delete other authors’ entries
ja: ↳ 他の投稿者のエントリを削除する

source: ↳ Edit other authors’ drafts
ja: ↳ 他の投稿者の下書きを編集する

source: ↳ Edit other authors’ entries
ja: ↳ 他の投稿者のエントリを編集する

source: ↳ Perform Craft and plugin updates
ja: ↳ Craft CMS 起動とプラグインのアップデート

source: ↳ Publish entries
ja: ↳ ライブの変更を発表する

source: ↳ Publish other authors’ drafts
ja: ↳ 他の投稿者の下書きを投稿する

source: ↳ Publish other authors’ entries
ja: ↳ 他の作成者の入力のためライブを変更する

source: ↳ Register users
ja: ↳ ユーザーを登録する

source: ↳ Remove files
ja: ↳ ファイルとフォルダーを削除

source: ↳ Upload files
ja: ↳ アップロード
